Tekla.Structures.DialogInternal.IDialogOwner
IDialogOwner Interface represents catalog dialog owner

Tekla.Structures.DialogInternal.IDialogOwner.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data